app/controllers/dojos_controller.rb

  def index
    @dojos = Dojo.all
---
SELECT "dojos".* FROM "dojos"

  def create
    Dojo.create(branch: params[:branch], street: params[:street], city: params[:city], state: params[:state])
---
INSERT INTO "dojos" ("branch", "street", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["branch", "branch"], ["street", "street"], ["city", "city"], ["state", "state"], ["created_at", "2017-10-16 19:24:32.536382"], ["updated_at", "2017-10-16 19:24:32.536382"]]

  def show
    @dojos1 = Dojo.all
    @dojos = Dojo.find(params[:id])
    @students = Student.where(dojo_id: params[:id])
---
SELECT  "dojos".* FROM "dojos"  ORDER BY "dojos"."id" ASC LIMIT 1
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 1]]
SELECT "students".* FROM "students" WHERE "students"."dojo_id" = ? AND ("students"."id" != ?)  [["dojo_id", 12], ["id", 7]]

  def edit
    @dojos = Dojo.find(params[:id])
---
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 0]]

  def update
    dojos = Dojo.find(params[:id])
    dojos.branch = (params[:branch])
    dojos.street = (params[:street])
    dojos.city = (params[:city])
    dojos.state = (params[:state])
    dojos.save
---
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "dojos" SET "branch" = ?, "street" = ?, "city" = ?, "state" = ?, "updated_at" = ? WHERE "dojos"."id" = ?  [["branch", "CD San Jose2"], ["street", "2222 Zonker Rd2"], ["city", "San Jose2"], ["state", "CA2"], ["updated_at", "2017-10-16 22:10:27.741959"], ["id", 2]]

  def destroy
    dojos = Dojo.find(params[:id])
    dojos.destroy
---
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "dojos" WHERE "dojos"."id" = ?  [["id", 5]]