app/controllers/students_controller.rb

  def new
    @dojos = Dojo.all
    @dojo = Dojo.find(params[:id])
---
SELECT "dojos".* FROM "dojos"
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 12]]

  def create
    @dojo = Dojo.find(params[:id])
    # student = Student.new(student_params)
    Student.create(first_name: params[:first_name], last_name: params[:last_name], email: params[:email], dojo_id: params[:dojo_id])
---
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "students" ("first_name", "last_name", "email", "dojo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "test1"], ["last_name", "test1"], ["email", "test4"], ["dojo_id", 4], ["created_at", "2017-10-17 22:13:20.358353"], ["updated_at", "2017-10-17 22:13:20.358353"]]

  def show
    @dojo = Dojo.find(params[:dojo_id])
    @student = Student.find(params[:id])
    @students = Student.where(dojo_id: params[:dojo_id]).where.not(id: params[:id])
---
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 7]]
SELECT "students".* FROM "students" WHERE "students"."dojo_id" = ? AND ("students"."id" != ?)  [["dojo_id", 12], ["id", 7]]

  def edit
    @dojo = Dojo.find(params[:dojo_id])
    @student = Student.find(params[:id])
    @students = Student.where(dojo_id: params[:dojo_id]).where.not(id: params[:id])
---
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
SELECT "students".* FROM "students" WHERE "students"."dojo_id" = ? AND ("students"."id" != ?)  [["dojo_id", 12], ["id", 8]]

  def update
    dojo = Dojo.find(params[:dojo_id])
    student = Student.find(params[:id])
    student.first_name = (params[:first_name])
    student.last_name = (params[:last_name])
    student.email = (params[:email])
    student.save
---
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 12]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "email" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", nil], ["last_name", nil], ["email", nil], ["updated_at", "2017-10-18 01:43:16.715191"], ["id", 8]]